Repository: imikado/glfos-samba-shares
Catalog: po/*.po
Languages: fr

source: Samba Share Manager
fr: Gestionnaire de partages Samba

source: Configure local and remote network shares
fr: Configurer les partages réseau locaux et distants

source: Local Shares
fr: Partages locaux

source: Share folders from this computer on the network
fr: Partager des dossiers de cet ordinateur sur le réseau

source: Manage Local Shares
fr: Gérer les partages locaux

source: View, edit, and delete existing shares
fr: Voir, modifier et supprimer les partages existants

source: Add New Share
fr: Ajouter un nouveau partage

source: Create a new folder share
fr: Créer un nouveau partage de dossier

source: Remote Shares
fr: Partages distants

source: Connect to shares on other computers
fr: Se connecter aux partages sur d'autres ordinateurs

source: Manage Remote Shares
fr: Gérer les partages distants

source: View, edit, mount, and unmount remote shares
fr: Voir, modifier, monter et démonter les partages distants

source: Add New Remote Share
fr: Ajouter un nouveau partage distant

source: Connect to a share on another computer
fr: Se connecter à un partage sur un autre ordinateur

source: About NixOS Integration
fr: À propos de l'intégration NixOS

source: Changes are saved to /etc/nixos/customConfig/default.nix
fr: Les modifications sont enregistrées dans /etc/nixos/customConfig/default.nix

source: Rebuilding NixOS configuration...
fr: Reconstruction de la configuration NixOS en cours...

source: Failed to rebuild NixOS configuration
fr: Échec de la reconstruction de la configuration NixOS

source: Welcome to Samba Share Manager
fr: Bienvenue dans le gestionnaire de partages Samba

source: This application helps you manage your Samba shares on NixOS
fr: Cette application vous aide à gérer vos partages Samba sur NixOS

source: Don't show this dialog again
fr: Ne plus afficher ce dialogue

source: Continue to Application
fr: Continuer vers l'application

source: Samba Shares
fr: Partages Samba

source: Close
fr: Fermer

source: Refresh
fr: Actualiser

source: No Shares Configured
fr: Aucun partage configuré

source: Click 'Setup New Share' to add your first share
fr: Cliquez sur 'Nouveau partage' pour ajouter votre premier partage

source: Settings
fr: Paramètres

source: Edit
fr: Modifier

source: Error Loading Shares
fr: Erreur lors du chargement des partages

source: Please close and reopen to refresh
fr: Veuillez fermer et rouvrir pour actualiser

source: Setup New Samba Share
fr: Configurer un nouveau partage Samba

source: Edit Samba Share
fr: Modifier le partage Samba

source: Basic Information
fr: Informations de base

source: Share Name
fr: Nom du partage

source: Path
fr: Chemin

source: Browse...
fr: Parcourir...

source: Browsable
fr: Visible

source: Share is visible in network browsing
fr: Le partage est visible dans la navigation réseau

source: Read Only
fr: Lecture seule

source: Users can only read files
fr: Les utilisateurs ne peuvent que lire les fichiers

source: Guest OK
fr: Accès invité

source: Allow guest access without password
fr: Autoriser l'accès invité sans mot de passe

source: User &amp; Group Settings
fr: Paramètres utilisateur et groupe

source: Force User
fr: Forcer l'utilisateur

source: Force all file operations as this user
fr: Forcer toutes les opérations de fichiers en tant que cet utilisateur

source: Force Group
fr: Forcer le groupe

source: Force all file operations as this group
fr: Forcer toutes les opérations de fichiers en tant que ce groupe

source: Cancel
fr: Annuler

source: Add Share
fr: Ajouter le partage

source: Save Changes
fr: Enregistrer les modifications

source: Select Folder
fr: Sélectionner un dossier

source: Share name is required
fr: Le nom du partage est requis

source: Path is required
fr: Le chemin est requis

source: Share added successfully. Please rebuild NixOS to apply changes.
fr: Partage ajouté avec succès. Veuillez reconstruire NixOS pour appliquer les modifications.

source: Share updated successfully. Please rebuild NixOS to apply changes.
fr: Partage mis à jour avec succès. Veuillez reconstruire NixOS pour appliquer les modifications.

source: Failed to add share
fr: Échec de l'ajout du partage

source: Failed to update share
fr: Échec de la mise à jour du partage

source: Remote Samba Shares
fr: Partages Samba distants

source: Add Remote Share
fr: Ajouter un partage distant

source: Mounted
fr: Monté

source: Not mounted
fr: Non monté

source: Remote Path
fr: Chemin distant

source: Mount Point
fr: Point de montage

source: Mount
fr: Monter

source: Unmount
fr: Démonter

source: Share unmounted successfully
fr: Partage démonté avec succès

source: Unmount failed
fr: Échec du démontage

source: Error
fr: Erreur

source: Mount requires credentials. Use 'sudo mount -t cifs ...' or nixos-rebuild.
fr: Le montage nécessite des identifiants. Utilisez 'sudo mount -t cifs ...' ou nixos-rebuild.

source: Configure remote shares in your NixOS configuration
fr: Configurez les partages distants dans votre configuration NixOS

source: Add Remote Samba Share
fr: Ajouter un partage Samba distant

source: Edit Remote Samba Share
fr: Modifier le partage Samba distant

source: Local directory where the remote share will be mounted (e.g., /media/share)
fr: Répertoire local où le partage distant sera monté (ex: /media/partage)

source: SMB share path (e.g., //server/share)
fr: Chemin du partage SMB (ex: //serveur/partage)

source: Credentials File
fr: Fichier d'identifiants

source: Path to file containing username and password
fr: Chemin vers le fichier contenant l'identifiant et le mot de passe

source: Select Credentials File
fr: Sélectionner le fichier d'identifiants

source: Mount Options
fr: Options de montage

source: User ID (uid)
fr: ID utilisateur (uid)

source: The user ID that will own the mounted files
fr: L'ID utilisateur qui sera propriétaire des fichiers montés

source: Group ID (gid)
fr: ID groupe (gid)

source: The group ID that will own the mounted files
fr: L'ID groupe qui sera propriétaire des fichiers montés

source: Additional Options
fr: Options supplémentaires

source: These options will be automatically included in the configuration
fr: Ces options seront automatiquement incluses dans la configuration

source: These options are automatically included in the configuration
fr: Ces options sont automatiquement incluses dans la configuration

source: Auto-mount
fr: Montage automatique

source: Automatically mount on system startup
fr: Monter automatiquement au démarrage du système

source: Mount on access
fr: Monter à l'accès

source: Only mount when accessed (noauto)
fr: Monter uniquement lors de l'accès (noauto)

source: The new share will be added to your NixOS configuration. Run 'sudo nixos-rebuild switch' to apply changes.
fr: Le nouveau partage sera ajouté à votre configuration NixOS. Exécutez 'sudo nixos-rebuild switch' pour appliquer les modifications.

source: Changes will be written to your NixOS configuration. Run 'sudo nixos-rebuild switch' to apply them.
fr: Les modifications seront écrites dans votre configuration NixOS. Exécutez 'sudo nixos-rebuild switch' pour les appliquer.

source: Mount point is required
fr: Le point de montage est requis

source: Remote path is required
fr: Le chemin distant est requis

source: Mount point must be an absolute path (start with /)
fr: Le point de montage doit être un chemin absolu (commençant par /)

source: Remote path must start with // (e.g., //server/share)
fr: Le chemin distant doit commencer par // (ex: //serveur/partage)

source: User ID must be a number
fr: L'ID utilisateur doit être un nombre

source: Group ID must be a number
fr: L'ID groupe doit être un nombre

source: Share added successfully. Run 'sudo nixos-rebuild switch' to apply changes.
fr: Partage ajouté avec succès. Exécutez 'sudo nixos-rebuild switch' pour appliquer les modifications.

source: Share updated successfully. Run 'sudo nixos-rebuild switch' to apply changes.
fr: Partage mis à jour avec succès. Exécutez 'sudo nixos-rebuild switch' pour appliquer les modifications.

source: User &amp; Group
fr: Utilisateur et groupe
